'use strict';
const TRADITIONAL_DEEP = [
	['樱桃红', '#ED3321'],
	['朱红', '#ED5126'],
	['杏黄', '#F28E16'],
	['琥珀黄', '#FEBA07'],
	['姜黄', '#E2C027'],
	['葱绿', '#40A070'],
	['宝石绿', '#41AE3C'],
	['石绿', '#57C3C2'],
	['碧青', '#5CB3CC'],
	['靛青', '#1661AB'],
	['群青', '#1772B4'],
	['山梗紫', '#61649F'],
	['槿紫', '#806D9E'],
	['青莲', '#8B2671'],
	['玫瑰紫', '#BA2F7B'],
	['品红', '#EF3473'],
];

const TRADITIONAL_LIGHT = [
	['水红', '#F1C4CD'],
	['藕荷', '#EDC3AE'],
	['杏仁黄', '#F7E8AA'],
	['莲子白', '#E5D3AA'],
	['橄榄石绿', '#B2CF87'],
	['艾背绿', '#DFECD5'],
	['艾绿', '#CAD3C3'],
	['霁青', '#63BBD0'],
	['月白', '#EEF7F2'],
	['远山紫', '#CCCCD6'],
	['淡青紫', '#E0C8D1'],
	['丁香淡紫', '#E9D7DF'],
	['淡牵牛紫', '#D1C2D3'],
	['凤信紫', '#C8ADC4'],
	['芝兰紫', '#E9CCD3'],
	['萝兰紫', '#C08EAF'],
];

module.exports = {colors:[...TRADITIONAL_DEEP,...TRADITIONAL_LIGHT]};
